Tekla.Structures.Model.Internal.IReportingExcelDialogCallback
Callback interface for showing Excel report dialog.

Tekla.Structures.Model.Internal.IReportingExcelDialogCallback.OpenReportingExcelDialog(Tekla.Structures.Model.Internal.ExcelReportData@)
Called when an xlsx report was selected by the user.